#+title: Exercise 26
** Result

#+begin_src bash :exports results :results output
racket ./src/exercise-26.rkt
#+end_src

#+RESULTS:
: ok
: pass: exact value lookup for number table expected: b got: b
: pass: equivalent lookup for number table expected: b got: b

This is working as we expect, as now, we have a third level nesting for a table insertion and lookup, which through our edge to edge testing, has passed.
